[
    {
        "ranking": 1,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Face/Off",
        "year": 1997,
        "description": "In Face/Off, John Travolta plays Sean Archer, an FBI agent hunting a terrorist, Castor Troy (Nicolas Cage) who killed Archer’s son in an assassination attempt on Archer. Early in the movie, Troy ends up in a coma, but has planted an explosive device hidden in Los Angeles. To try and discover the secret location, Archer undergoes a procedure wherein Archer’s face is removed and Troy’s face is attached, becoming Castor Troy. Of course, later Archer’s face is attached to Troy. How can such a strange premise for a movie result in one of the best action movies of all time and my personal favorite Nicolas Cage movie? I could write an essay on the merits of Face/Off, but I will try and keep it as concise as possible. For starters, the acting is shockingly good. The first third of the movie develops the Castor Troy and Sean Archer characters so well and then flips them such that you get to watch Travolta playing Cage’s Troy and Cage playing Travolta’s Archer. Both of them nail it, not only recreating the already established mannerisms of the characters but also recreating the other actor’s eccentricities. Particularly for this type of action movie where acting sometimes takes a backseat, both actors show that they are geniuses in their prime. Moreover, John Woo’s direction leads to a briskly paced 139 minutes. Whether it is the characters or the camera, it feels like something is moving in every shot, making even purely dialog scenes exciting. These combine to make Face/Off the perfect conclusion to the Beige Volvo trilogy. Sure, the premise is hilarious in concept but they somehow nail the landing in execution. The action sequences are neatly spaced throughout the film and are well-done and engaging, with thrilling moments that will have you on edge. Plus, Face/Off is littered with iconic and hilarious moments, such as the “take his face off”/“no more drugs for that man” scene, Cage dancing around in priest garb to Handel's Messiah, and the creepy “eat a peach for hours” scene. But the main reason why this movie lands at number one on this list: This is the ultimate Nicolas Cage movie in terms of sheer entertainment. He is over-the-top and unconventional, while at the same time showing nuanced acting skills. This leads this to be one of the more highly memed Cage movies while maintaining a level of quality that transcends the memes. It is simply the most enjoyable and rewatchable Cage movie. TAGS: Nicolas Cage Movies Ranked; Nicolas Cage Films Ranked; Nicolas Cage Film Ranking; Nicolas Cage Movie Ranking; Nicolas Cage Movie Reviews"
    },
    {
        "ranking": 2,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Pig",
        "year": 2021,
        "description": "In Pig, Cage plays a recluse living in the Oregon forests with his truffle-hunting pig, until his Pig is stolen forcing him to return to Portland and confront his previous life. If you have not seen Pig, do not look up anything else about this movie: Just watch it and experience it going in as blind as possible. Of Nicolas Cage’s 97+ films, I believe that his turn in Pig is his very best acting performance. Every silent emotion, every line of dialogue, and every other thing he conveys is a masterclass. You deeply feel what his character feels and if you are not sharing tears with Cage multiple times, you likely were not paying attention. Even with his distinctive style and that face you have seen thousands of times, it is easy to forget this is Cage. One of the biggest Oscar snubs ever was not even nominating Nicolas Cage for Best Actor for Pig. While Pig is such a stunning success because of an all-time Cage performance, the rest of the movie is a moving story about loss and the power of shared experience, in particular, meals. This is the directorial debut of Michael Sarnoski and he absolutely nails every aspect of this story (which was also co-written by Sarnoski). The melancholic atmosphere throughout is expertly molded by beautiful shadowy shots of Oregon’s forests and cloudy Portland. This movie is a modern day masterpiece that should be required viewing by anyone who likes movies or considers themselves a foodie."
    },
    {
        "ranking": 3,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Raising Arizona",
        "year": 1987,
        "description": "I love almost every movie the Coen Brothers have directed, and Raising Arizona is unsurprisingly high-up on that list. This crime comedy stars Nicolas Cage as an ex-convict married to a former police officer (Holly Hunter) who cannot have children, so they steal one of the quintuplets from a regional celebrity furniture salesman. Add in a mix of fantasy and action and this movie really shines. Raising Arizona was the Coen Brothers second movie they wrote and directed, and their first of many comedies (such as The Big Lebowski and O Brother, Where Art Thou?). At the time he was cast, Cage was an up-and-coming actor, but this was before he became more well known with the success of Moonstruck. Thus, Raising Arizona is a fascinating early showcase of one of the best modern-day writer-director duos first delving into comedy featuring one of the best living actors still at the time honing his craft. The results could not be better. While much of the humor is situational, Cage nonetheless rises to the occasion by delivering some truly funny and absurd lines. If you ever wanted to cackle at an outlandish diaper heist scene, look no further than Raising Arizona. Admittedly, as with many Coen Brothers movies, the humor is not for everyone. But if it is your style, this is bound to be one of your favorites, and it remains a must-watch Cage classic."
    },
    {
        "ranking": 4,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Adaptation",
        "year": 2002,
        "description": "Speaking of meta comedies featuring Nicolas Cage playing two characters at the same time . . . Adaptation is a movie written by Charlie Kaufman and tells the story of Charlie Kaufman and his fictitious brother Donald Kaufman (both played by Nicolas Cage) as Charlie struggles to adapt the book, The Orchid Thief. Interspersed and intersecting with the Kaufman brothers’ trials and tribulations is the actual story from The Orchid Thief book, with Meryl Streep playing a fictitious iteration of real-life author Susan Orlean as she is interviewing and spending time with John Laroche, a plant-dealer and orchid thief played by Chris Cooper. As one would hope with a movie about a screenplay writer writing a screenplay, the script is brilliant. At times laugh-out-loud funny with tender and dramatic moments, Kaufman manages to show off his skills as a screenwriter through satirizing himself as a screenwriter. It is further bolstered by true powerhouse acting performances. Cooper deservedly won the Academy Award for Best Supporting Actor while Cage was nominated for Best Actor and Streep was nominated for Best Supporting Actress. Also, fun fact: The screenplay was credited to both Charlie Kaufman and Donald Kaufman, and when it received an Oscar nomination for Best Adapted Screenplay (which is should have won,) Donald Kaufman became the first truly fictitious Oscar nominee (i.e., not a name that was a cover for a real person.) Focusing on Cage, this is up there with his greatest performances. It is impressive that he is able to encapsulate both neurotic and nervous Charlie and gregarious and sweet Donald. But it is even more impressive that he is able to make these characters interact so seamlessly throughout the movie."
    },
    {
        "ranking": 5,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "The Unbearable Weight of Massive Talent",
        "year": 2022,
        "description": "It is rare that a movie can be so perfectly tailored to your taste on paper and then actually meet or exceed expectations. For me, this is the Unbearable Weight of Massive Talent. I adore Nicolas Cage, I love action comedy, and I am a sucker for meta humor, so my anticipation for this movie was sky high. It delivered on all fronts. This feels crazy to say as a huge Cage fan evaluating a film where he plays himself, but the surprise standout here is Pedro Pascal. Pascal’s performance is hilarious, and he frequently steals scenes both with his comedic timing and how genuine he plays his character. Cage is brilliant as well of course and deserves major props for leaning into and exaggerating some less favorable characteristics. Indeed, the funniest scenes may be Cage's alter ego younger self \"Nicky Cage\" interacting with current day Cage. Who doesn't love two Nicolas Cages at once? But the main reason this movie works so well is because of how Cage and Pascal play off of each other and we should all hope for more collaborations in the future. While you will undoubtedly enjoy this movie more the deeper your understanding of Cage and Cage lore, the set-up, the story, and the jokes will still be funny even with a base level Cage knowledge. At the end of the day, it is a comedy about a struggling actor and an unexpected friendship with one of his biggest fans. The added Cage meta element only makes this would be amusing concept even better. Pedro, Nick, and I recommend a double feature with Paddington 2."
    },
    {
        "ranking": 6,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Wild at Heart",
        "year": 1990,
        "description": "“Hey, my snakeskin jacket! Thanks, baby! Did I ever tell you that this here jacket represents a symbol of my individuality and my belief in personal freedom?” It is hard to better sum up this Nicolas Cage role than his most famous quote from the movie. Wild at Heart is classic David Lynch. There is an underlying mystery throughout with characters revealing their uglier sides through stranger and stranger interactions. Everyday life mixes with fantastic visions, in this case, Wizard of Oz themed. Actors give odd performances that would be out of place in any other film but fit perfectly here. It is filled with sex, violence, and dark humor. And as with other David Lynch material, it was polarizing at the time (winning the Palme d’Or at Cannes but receiving negative reviews on wider release,) but has now built a legacy over the years. All that to say, if you like David Lynch, you will love Wild at Heart. Both Cage and his co-star, Laura Dern, are the standouts. Cage’s sensibilities to take his character over-the-top while doing so in a straight-faced manner serve him well here and match Lynch’s directorial style perfectly. Art imitates life a bit in this movie, with Cage’s character’s obsession with Elvis channeling Cage’s real life reverence for the King. Equally entertaining here is Diane Ladd, Dern’s real life mother, playing Dern’s character's mother here. Watch out for Willem Dafoe towards the end of the movie, giving one of his creepiest performances. As with many Cage films, it is definitely a weird ride, but one that I recommend taking at least once."
    },
    {
        "ranking": 7,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Mandy",
        "year": 2018,
        "description": "While these rankings are based solely on my opinion of these movies as Cage movies, Mandy deserves a bit of background in the Cage timeline: Cage’s star rose to its highest heights with his Oscar win, the Beige Volvo Trilogy, and other well-known movies like National Treasure, Gone in 60 Seconds, Matchstick Men, and other early 2000s hits. After a few movies with less commercial and critical success, Cage's star as a blockbuster leading man sadly seemed to fade and he was in more and more direct-to-video/streaming movies that were seen primarily by Cage aficionados and genre buffs. Then suddenly, Cage appeared in Mandy, a critically acclaimed psychological horror and action movie. Cage is fantastic here, free-falling off the edge of sanity into a twisted world and obliterating anything that gets in his way, which in this case includes religious cult members and a demonic biker gang that heavily ingests LSD and has become cannibalistic. This movie has some of the wildest visuals in general, but there are some truly unforgettable Cage scenes firmly in the mix. It also has a top-tier soundtracks, one of the last ever from the great and gone-too-soon Jóhann Jóhannsson. Mandy is violent, unpredictable, and gruesome. The director successfully makes you the viewer feel like you are in the middle of a bad acid trip. It is not a movie for everyone, but if it happens to be for you, you will be so invested in this film from the opening credits to the unreal ending. To me, it is an all-around modern classic."
    },
    {
        "ranking": 8,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "National Treasure",
        "year": 2004,
        "description": "There are people who swear by A Christmas Story, How the Grinch Stole Christmas, and/or Christmas Vacation for Christmas. There are people who cannot decide if Nightmare Before Christmas is a Christmas movie or a Halloween movie so they watch it on both to be safe. There are numerous other holiday traditions centered on a variety of films. As for me, for at least 11 years, I have convinced my family, friends, colleagues, and anyone in my orbit to watch National Treasure on the Fourth of July. While I remember some American history from high school, much of my knowledge comes from this movie. National Treasure is a near perfect Nicolas Cage film simply because an intelligent treasure-quest style film is well-suited for Cage, melding his action hero roles with his indie drama personas. His Benjamin Franklin Gates character is uniquely suave, brilliant, cocky, and sophisticated, yet has a side of him that is silly and nerdy. Oh, and like Cage himself, Gates is very interested in acquiring treasure (see, e.g., Nicolas Cage outbidding Leonardo DiCaprio for a dinosaur skull.) Outside of Cage, this movie is fast-paced and clever, with action neatly intersecting the underlying mystery and the more subdued clue discovery scenes. Sure, there are more critically acclaimed Cage movies out there and there are better Cage performances, but National Treasure is a damned-near magnum opus if entertainment is what you seek. Plus it is important in the Cage cannon as it is (sadly) the beginning-and-end of many casual Cage viewers repertoire. You can always hook them in talking about National Treasure and then show them the next 7 movies . . . (followed by the previous 82)."
    },
    {
        "ranking": 9,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Leaving Las Vegas",
        "year": 1995,
        "description": "Since March 25, 1996, every movie that Nicolas Cage has appeared in has dropped the line “Academy Award Winner Nicolas Cage” (or some paraphrase) in at least one piece of marketing material. Thus, it seems crazy to have Cage’s only Oscar winning performance as low as 9, but that is just how good Cage is! (Plus, in my opinion he should have won at least a couple more since then). Leaving Las Vegas is one of those movies that I recommend everyone watch once, but not necessarily more than once because it is quite sad and frequently hard to watch. It features some all-time great performances by Cage and Elisabeth Shue (who should have won Best Actress to pair with Cage’s victory). As a brief overview, it is based on a semi-autobiographical novel with Cage playing an alcoholic screenwriter who goes to Las Vegas to drink himself to death, and in the process meets Sera (Shue,) a prostitute working for an abusive pimp. The author of the book, John O’Brien, sadly committed suicide after signing away the film rights to the novel. On the surface, this is sad story about broken people finding each other, but as you peel back the layers this is a movie about compassion, acceptance, and love. While it is a top-tier film anyway you shake it, Cage’s and Shue’s performances really elevate this movie to the stratosphere of all-time dark indie dramas."
    },
    {
        "ranking": 10,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Kiss of Death",
        "year": 1995,
        "description": "If you know anything about Nicolas Cage, you likely know of (or at least have heard of) the next 9 movies on this list, leaving Kiss of Death as the wild card in the top 10. To be honest, that makes sense, as this is the highest ranked movie where Cage is not the central player. And to be fair, Kiss of Death is a pretty random 90s crime thriller that was not a financial success, despite its excellent cast. That said, I would be hard pressed to find a movie where I enjoyed each pivotal character as much as I do in Kiss of Death. To begin with Nicolas Cage, he plays a psychotic mobster named Little Junior Brown, who bench-presses strippers at his family-owned strip club (named \"Baby Cakes\"), is obsessed with acronyms thus giving himself the acronym B.A.D. (\"Balls, Attitude, Direction\"), and who was in prison but ate with his hands because he does not like the taste of metal in his mouth. Little Junior Brown is one of the weirdest yet best Cage roles, a real 10/10 on Cageiness. Next is Ving Rhames, the gangster with great lines such as: “Red is my bad luck color. I ain’t got nothing to do with red.” Let us not forget Samuel L. Jackson, a detective who is grazed by a bullet in an early scene causing him to have an eye issue and leading him to be constantly wiping away tears with an angry scowl only Jackson could maintain. This of course ignores our lead performance, with David Caruso giving some of the most over-the-top 90s action “reformed criminal but back in crime to help the good guys” script reads you’ve ever heard in a movie (he did get a Razzie nomination for this and other films that year, but the supporting roles really save his performance.) There are also memorable turns by Helen Hunt, Stanley Tucci, Kathryn Erbe, and Michael Rapaport. All this to say that Kiss of Death is all over the map in terms of acting and storytelling, but it is the type of enjoyable chaos that benefits from Cage and features one of my favorite Cage performances. Plus, this strange cast of characters thrust together haphazardly somehow still forms the perfect jigsaw puzzle of action, comedy, and crime, with the end result being a excellent forgotten gem of the 90s."
    },
    {
        "ranking": 11,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Vampire's Kiss",
        "year": 1989,
        "description": "For those of you who have followed my Nicolas Cage journey, you will know in the last 10 years this movie has been ranked high as #3 and as low as # 30. It is a difficult egg to crack. Vampire’s Kiss is one of the most memed Cage roles. And fair enough: He gets weird with this one. He yells the ABCs at his therapist, he wears vampire teeth and runs around screaming about being a vampire, his cries are overdramatic “boo hoos,” and he makes the famous expression from the “YOU DON’T SAY” Cage meme template. Cage really goes all out on the method acting here, including actually eating multiple cockroaches during the performance. As for the movie itself, it is a very dark comedy about a man who becomes convinced he is a vampire and puts a blowtorch to his personal and professional life based on his convictions. There are intentionally funny moments, unintentionally funny moments, and a lot of uncomfortable moments. But through it all, and despite the scenes you may see in a meme or a Cage compilation, this is an inspired performance with a lot to like. This may not be your favorite movie, but you will be so entertained by the strangeness of it all. It is the type of Cage movie to make you stop and scream: THIS IS ART!"
    },
    {
        "ranking": 12,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Bad Lieutenant: Port of Call New Orleans",
        "year": 2009,
        "description": "“Shoot them again . . . their soul’s still dancing!” Bad Lieutenant: Port of Call New Orleans is one of those movies that, on paper, does not seem like it would be an all-time Nicolas Cage classic but rather another late-00s/early-10s effort which is fine yet forgettable. Cage plays a New Orleans police officer with an alcoholic father, a prostitute girlfriend, and who is rapidly becoming more and more corrupt and drug-addled during his investigation into a murder of a Senegalese family. What is an excellent but relatively straightforward bad cop movie takes a turn close to the halfway mark when a drugged-up lieutenant Cage asks his partner one simple question: “What are these fuckin’ iguanas doing on my coffee table?” There are no iguanas (according to his partner,) yet the camera zooms in and out on a confused looking Cage and iguanas sitting on the coffee table while the song “Release Me” plays. From here the movie lifts into another dimension. Cage is transcendent as a struggling police officer and the story builds around him as the centerpiece. It is funny, it is gritty, it is sad, it is a Herzgog movie with the added benefit of one of Cage’s best performances out of nowhere. By my calculation, in almost 20% of the movies on this list Cage plays a cop, solider, law enforcement agent, or other similar role: This is the best one."
    },
    {
        "ranking": 13,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Con Air",
        "year": 1997,
        "description": "Con Air, the middle entry in the Beige Volvo trilogy, is everything you want in a 90s action movie: (1) Excellent setup where you can predict exactly what is about to happen? Check: Nicolas Cage plays a former Army Ranger being released from prison who has to be transported on a plane full of the most notorious and dangerous convicts with mostly unarmed guards. (2) Outlandish and over-the-top characters? Check: John Malkovich, Steve Buscemi, Dave Chappelle, Ving Rhames, and, of course, Cage each bring so much eccentricity to their characters. (3) Absurd action sequences with unfathomable amounts of property destruction?  Check: Without spoilers, the ending thirty minutes is unbelievable. (4) Absolute banger of country ballad appearing over multiple emotional scenes? Check: HOW DO I LIVE WITHOUT YOU, I WANT TO KNOW! You will probably laugh, you may or may not be on the edge of your seat, but you would be hard-pressed not to have a great time. As one final note: It would be an injustice not to mention Cage’s hair and accent, both of which are some of the most iconic (and most memed) parts of his illustrious career. Hilarious out of context and still amusing in context, once you’ve experienced Con Air, it is just hard to “put the bunny back in the box.”"
    },
    {
        "ranking": 14,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Lord of War",
        "year": 2005,
        "description": "Lord of War provides an intelligently crafted analysis of the gun trade neatly packaged in a fast-paced crime drama. From its tone-setting opening sequence to the concluding monologue, this movie rarely lets its foot off the gas. Despite its subject matter and dismal worldview, there are dark comedic undertones throughout. Plus, it is hard not be entertained by Jared Leto’s character preparing a line of cocaine in the shape of Ukraine, his and Cage’s characters’ home county. As great as Lord of War is, it is elevated to another tier by Nicolas Cage. The lead role is tailor-made for Cage, allowing him to make his illegal arms dealer character a quirky and competitive businessman, a suave and cocky criminal, and a seeming family man who constantly shows he is anything but. What is perhaps most impressive about this performance is how neutral and apathetic about the world Cage plays it, portraying a man able to separate his emotions from his less than savory work and who does not care if good or evil prevails so long as he is the one getting paid."
    },
    {
        "ranking": 15,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Red Rock West",
        "year": 1995,
        "description": "Following his Academy Award win for the 1995 film Leaving Las Vegas, Nicolas Cage had a long run of mainly appearing in Hollywood blockbusters. But in the years before that, Cage appeared in some magnificent smaller movies, including Red Rock West. This neo-noir contemporary Western features Cage as an ex-Marine drifter who is mistaken by a small-town bar owner as a hitman the bar owner had hired to kill his wife. When Cage pretends to be the hitman and takes the money but warns the wife instead of killing her, it gets him tangled in a wild web with the actual hitman and the bar owner, who it turns out is also the local sheriff. This movie perfectly finds the balance of being a slow-burn while maintaining an excellent and engaging pace. The great acting and well-written characters throughout amplifies this, resulting in this hidden 90s gem."
    },
    {
        "ranking": 16,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "The Rock",
        "year": 1996,
        "description": "The Rock is the first entry in the greatest unofficial trilogy of all time (The Rock, Con Air, and Face/Off,) which (as discussed below) has been dubbed the “Beige Volvo” trilogy. In this action-thriller, a group of rogue marines (led by Ed Harris) steal rockets filled with a potent chemical weapon and threaten to attack San Francisco after taking control of the famous Alcatrez prison. Nicolas Cage plays an FBI chemical weapons specialist who teams up with the only man to escape Alcatrez (Sean Connery) to sneak into Alcatrez and render the rockets ineffective. The background of Connery’s character being a former British secret agent have led to great fan theories tying this to his James Bond portrayal. This is one of the best Cage action movies. It has a great concept, quality acting, fast-paced dialog with some tremendous one-liners, and dynamite action scenes. Plus, even though it is only Michael Bay’s second film, it already contains many of the techniques he would continue to develop and use over the years (including some absolutely absurd explosions during a car chase scene). Add to that the fact that Quentin Tarantino and Aaron Sorkin were allegedly uncredited script doctors and it makes sense that this is a shining example of what a 90s action film could be. Plus, in his first post-Academy Award role, Cage brings a lot to what could have just been a run-of-the-mill non-field agent thrust into the field hero character. As a quick aside, multiple online forums have tied together The Rock, Con Air, and Face/Off as the “Beige Volvo Trilogy”. These three action blockbusters came out in 1996 and 1997 and all starred Nicolas Cage. As for the name, in the Rock, Cage’s character says in a speech about just being a biochemist with an uneventful life that he drives “a Volvo, a beige one.” In Con Air, a character is thrown out of the plane before landing on a beige Volvo. Lastly, in Face/Off, when escaping from prison, Cage steals a beige Volvo, completing the trilogy. Thus, an unofficial trilogy centered around Swedish cars and Nicolas Cage is born."
    },
    {
        "ranking": 17,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Bringing Out the Dead",
        "year": 1999,
        "description": "Frank Pierce is one of Nicolas Cage’s most haunting performances. In a severely underrated Martin Scorsese movie, Cage plays a paramedic struggling with depression, burnout, and seeing ghosts since he was unable to save a homeless teenage girl, leaving him in a funk of being unable to save a patient for months. The structure of this movie is tremendous, mostly telling the story through three different nights of Cage’s character riding along with vastly different partners: a food-motivated John Goodman, an enthusiastically religious Ving Rhames, and a violent and cruel Tom Sizemore. Intertwined with all of this is a stellar performance opposite Cage by his then wife (although already separated at the time) Patricia Arquette, who plays a recovering addict and the estranged daughter of one of Cage’s patients. Bringing Out the Dead is one of the most difficult Cage movies to watch, rapidly changing between high intensity medical emergencies to sorrowful and despondent conversations, though Scorsese does manage to sneak in a bit of humor to lighten it in places. But as is to be expected in a movie about EMTs, death follows the characters everywhere and is a looming presence in every scene. Yet, underneath all the sadness and gloom is a beautiful and moving story about compassion. Cage has noted in interviews that Bringing Out the Dead might be the best movie he ever made."
    },
    {
        "ranking": 18,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Longlegs",
        "year": 2024,
        "description": "As noted in the introduction, Longlegs is the most recent Nicolas Cage movie and is gaining a substantial amount of buzz, much of it about Cage’s performance. It is hard to rank a movie so quickly, so Longlegs is likely to move around this list in the future. Further, because the marketing and trailers were excellent in not spoiling much about the movie and even greater about not spoiling almost anything about Cage’s character or his appearance, I will keep this brief. Longlegs is a solid procedural serial killer horror thriller (think, Seven- and Silence of the Lambs-style movie). Cage is incredible and terrifying in this movie. Even though he is not in a lot of the movie (which I acknowledge is a complaint I have about some movies lower on this list) his appearances are so impactful and, combined with the nature of his character, lead to his aura permeating almost every shot of the film making him feel much more present. Speaking of which, this is some of the best cinematography I have seen in a horror movie, with almost every angle leaving somewhere you cannot see well enough for comfort. It may not be the scariest movie of the decade as some early reviews hyped it up to be, but it is certainly one of the most unnerving films of the decade. Hot take: Nicolas Cage should, and WILL, be nominated for Best Supporting Actor at this year’s Academy Awards. Though, I think he should have around 10 nominations by now so I am perhaps biased."
    },
    {
        "ranking": 19,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Dream Scenario",
        "year": 2023,
        "description": "When I first heard about this movie, I instantly thought this was one of the most inventive concepts for a movie in years, and perfect for Nicolas Cage to shine. Shine he did, delivering a performance so great that it got him his first Golden Globe nomination in 21 years. Be ready to cackle, as Cage has some truly hilarious scenes as a university professor who randomly ends up appearing in peoples’ dreams throughout the world. The “sex scene” in particular is traumatizing yet sidesplittingly funny. Allowing Cage to infiltrate dreams allows him to paint with a broad brush and take on all sorts of crazy, which he does with the skill only he can. And even though the story meanders a bit towards the end, the overall concept and one of Cage’s best ever performances more than make up for it, leaving this one of the most enjoyable Cage movies in a very strong filmography."
    },
    {
        "ranking": 20,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "The Weather Man",
        "year": 2005,
        "description": "This movie is refreshing. This Nicolas Cage performance is refreshing. The Weather Man is an excellent, offbeat dark dramedy about the difficult balance between professional ambitions and personal life focused on a myriad of quirky characters. But mostly it is centered on Cage’s David Spritz f/k/a Spritzel, a weather man on the verge of a national breakthrough but struggling in his personal life (separated from his wife, children with various issues, and health struggles for his father) while still facing professional challenges (such as his notoriety leading to people throwing a variety of fast food items at him). Cage delicately threads the needle between pathetic and smooth here, with the end result being a frequently funny but occasionally sad caricature of a weather man. . . who sometimes wanders the streets with a bow and arrow. Plus you get to hear Michael Caine don an American accent as an added bonus."
    },
    {
        "ranking": 21,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Season of the Witch",
        "year": null,
        "description": "There are probably a few other Nicolas Cage filmography rankings out there, and I imagine this is the highest Season of the Witch appears on any of these lists. This is truly my guilty pleasure Cage movie. Ron Perlman and Cage play deserting crusaders who are commanded by church elders to stop the Black Death by transporting a woman accused of being a witch to a monastery. (Fun fact: the accused witch character is the film debut of Claire Foy of later The Crown fame.) What is on-paper a solid concept ends up with a lot of ridiculous dialog and some truly abysmal CGI, leading to a frequently unintentionally hilarious movie. Then again, it is hard to have a serious film when you name the main priest character Debelzaq (which Cage pronounces “da-bell-sack” throughout.) That said, Cage and Perlman are an absolute joy to watch together and elevate this out of the “so bad its good” realm into the just plain fun action-adventure category. Sure, they play 1300s crusaders with miraculously perfect teeth and no accent of note but move past it. Even if not the best supernatural action-adventure film you’ve ever seen, the adventure itself is entertaining enough that you are at least unlikely to be bored. And if you are, just laugh at ludicrous number of times the words “witch,” “church,” “god,” “sin,” and “plague” are used throughout, particularly in the scene with the late, great Sir Christopher Lee. (Note: There are multiple Season of the Witch drinking games out there based around these words, but they should not be attempted lightly as it is non-stop in the script – play at your peril and with some very low ABV beers). I must note (possibly skewing this one in the rankings), when I first began my Cage journey, a group of friends and I found this movie so entertaining that we declared the 16th of every month Season of the Witch Sixteenth. As one of our Cage brethren sadly left us far too soon and was a big proponent of Season of the Witch Sixteenth, this one will always hold a dear place in my heart as a Cage Essential."
    },
    {
        "ranking": 22,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Color Out of Space",
        "year": null,
        "description": "Nicolas Cage in an H. P. Lovecraft adaptation: Sign me up! This movie is an artistic and trippy journey through the horrors of the unknown, leaving the viewers with a sense of existential dread along with some lingering images of out-of-this-world creatures and disturbing abominations. Color Out of Space does have some elements of stereotypical modern horror movies, but most of all it is just highly unsettling. Cage gives a great and nuanced performance here, teetering from calm-yet-concerned father to absolute lunatic."
    },
    {
        "ranking": 23,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Joe",
        "year": null,
        "description": "Joe is a dark and gritty Southern Gothic story about Nicolas Cage’s titular Joe character, a troubled man who hires a 15-year-old boy to his crew, and as he gets to know the boy better attempts to protect him from his alcoholic abusive father. While there are comedic and moving scenes buried under the heavier moments, the bulk of the film is very bleak. But in a time where Cage had been in a string of less-than-acclaimed action/thriller/crime movies, Joe gave the world a reminder what a restrained yet powerful actor he could be. It also helps that the supporting cast gives all-star performances, including an outstanding turn by Tye Sheridan and an incredible performance by Gary Poulter, who was experiencing homelessness and sadly passed before the movie was released, with this being his only credited role."
    },
    {
        "ranking": 24,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Valley Girl",
        "year": null,
        "description": "Ah, the first time the name Nicolas Cage graced the silver screen. Valley Girl is a comedic look into 1980s life as a teenager in Los Angeles, with bitchin’ slang and some tripendicular haircuts. The soundtrack is also a fantastic snapshot of the early 1980s that is not to be missed, with songs by artists like Sparks, Men at Work, and Culture Club. Don’t forget Modern English’s song “I Melt with You”, which is so great it is played multiple times in the movie. As for Cage, he comes out of the gate swinging and is hilarious, goofy, and suave. While I am clearly biased, he is iconic from his very first scene. Regardless of your opinion on the greatness of Cage, do not miss this sometimes overlooked but essential 1980s teen comedy."
    },
    {
        "ranking": 25,
        "tier": 1,
        "tier_description": "The 25 Most Essential Cage Movies",
        "title": "Matchstick Men",
        "year": null,
        "description": "In this Ridley Scott black comedy, Nicolas Cage plays a con artist with multiple neurological and behavioral disorders who meets his 14-year-old daughter (Alison Lohman) for the first time in the middle of trying to pull off a rare long con with his partner (Sam Rockwell). Matchstick Men is excellent, with heartfelt moments, some truly funny scenes, and a few excellent twists you are unlikely to see coming. To me, this is one of Cage’s best acting performances. He nails all aspects of his character, from a man struggling with his disorders to a sleezy con artist to a sentimental father, with a few noteworthy Cage freakouts mixed in for good measure (including a fan favorite, where Cage cuts in line at the pharmacy and in response to a sarcastic “Hey buddy, ever heard of a line?” he screams “Hey, have you ever been dragged to the sidewalk and beaten till you . . . PISSED BLOOD!”)"
    },
    {
        "ranking": 26,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Willy's Wonderland",
        "year": null,
        "description": "It is amazing that a movie where Nicolas Cage does not speak could be so high on a ranking of Cage movies. Lo and behold, Cage manages to do an astonishing amount with this silent and nameless Janitor character. On one hand, he makes the character hilarious in his dedication to the mission of cleaning an abandoned family entertainment center yet regimented in his strict routine of sticking to hourly breaks. On the other hand, he makes the character an unparalleled badass as he destroys rogue animatronic characters to try and save a group of teenagers. Prepare for lots of laughs interspersed with some quality Cage action and a bit of horror, though most of the frights are played for jokes."
    },
    {
        "ranking": 27,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Moonstruck",
        "year": null,
        "description": "Moonstruck is a fantastic romantic comedy, nominated for the Academy Award for Best Picture and netting Cher a Best Actress Oscar win. Nicolas Cage plays second-fiddle to Cher’s notably great performance and does an excellent job, earning Cage his first Golden Globe nomination. It even features some great early Cage freakouts that are not to be missed (for example, the “Johnny has his hand!” scene.) Moonstruck is the type of 1980s relic that is funny, sweet, and endearing in a way movies rarely are anymore. As a Cage fan, the scenes about the Cage-Cher romance are superb, but as a movie fan, the heart of this one is in Cher’s family scenes."
    },
    {
        "ranking": 28,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Gone in 60 Seconds",
        "year": null,
        "description": "Nicolas Cage plays a reformed car thief who has to steal 50 specific high-end cars within 72 hours to save his brother’s life. It is like Oceans 11 with cars, incorporating all the essential elements of a good heist movie: a large team of misfit personalities, extensive complicated heist planning with an overriding sense of impossibility, high speed car chases, and a dramatic conclusion. To make it even better, Cage is firing on all cylinders here, exuding a sense of cool, calm, and collected while on the verge of wild and crazy Cage the whole time."
    },
    {
        "ranking": 29,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Prisoners of the Ghostland",
        "year": null,
        "description": "Prisoners of the Ghostland frequently gives off the vibe that it is weird for the sake of being weird, but this actually works shockingly well for a Nicolas Cage movie. This post-apocalyptic horror western movie throws the viewer right into the center of the strange, quarantined region of Japan with the city of Samurai Town and its Governor, who dresses and sounds a bit like a creepier version of the KFC colonel. Cage, a criminal, has to go out into the Ghostland to find one of the Governor’s “granddaughters” who ran away, while wearing a bodysuit that will detonate his testicles if it is tampered with or he mistreats the granddaughter. This is the 10-minute intro set-up for a peculiar adventure that only gets crazier as it goes along. What makes it excellent is that you can tell Cage is having an absolute blast and he really takes an already enjoyably quirky film to the next level."
    },
    {
        "ranking": 30,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Drive Angry",
        "year": null,
        "description": "Drive Angry is one of the wildest rides you will go on in your Nicolas Cage journey. Cage’s character escapes from hell after stealing Satan’s gun to kill a cult-leader who murdered Cage’s daughter and is now planning to sacrifice his granddaughter. For lack of a better description, Drive Angry is 100 minutes of dumb fun that is best if you turn off your brain and just enjoy some grindhouse Cage action. Despite the unabashed absurdity of much of this movie, including Cage having a full gunfight while having sex (“I never disrobe before a gunfight”), Cage is actually less unhinged in this one than expected, keeping this one barely outside of the truly essential Cage movies. As a small added bonus, it is a fun relic of the 3D movie era, with multiple shots clearly designed to be cool in 3D but looking goofy as a shot in a regular movie."
    },
    {
        "ranking": 31,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Renfield",
        "year": null,
        "description": "Nicolas Cage is a PERFECT Count Dracula. He absolutely nails the role and tailors the character perfectly into the horror comedy nature of the film. This movie provides a comedic take on Dracula’s assistant/familiar, Renfield (Nicholas Hoult), working through his codependent relationship with Dracula in a self-help group while also becoming involved in a police officer’s dispute with a crime family. Renfield is funny, gory, and for the most part has solid supporting characters. The only real knock here is that it focuses too much on these other characters instead of on Cage who is, as usual, by far the best part."
    },
    {
        "ranking": 32,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "National Treasure: Book of Secrets",
        "year": null,
        "description": "As will be revealed later in this list, I adore the first National Treasure. And do not get me wrong: This sequel is still excellent, and I hope for more Nicolas Cage-led National Treasure films in the future. But National Treasure: Book of Secrets falls short of achieving the highs of the first film, due in part to the scenarios somehow becoming more over-the-top and less believable than stealing the Declaration of Independence. Somewhat relatedly, Cage is much kookier throughout this second installment, with multiple bonkers scenes that make the Benjamin Franklin Gates character even better. If you like National Treasure, do not sleep on the sequel, but as with many sequels to successful movies, come in with tempered expectations."
    },
    {
        "ranking": 33,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Mom and Dad",
        "year": null,
        "description": "While Mandy is more likely considered the movie that jump-started the current Cage-aissance (not that he went anywhere,) Mom and Dad should not be overlooked in his recent run of new Nicolas Cage classics. This black comedy horror movie about parents worldwide suddenly trying to kill their children is the type of absolute lunacy where Cage thrives. The few points throughout where the jokes and the gory violence wear thin are quickly redeemed by Cage being fully unhinged, somehow leveling up from all his previous craziness."
    },
    {
        "ranking": 34,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Birdy",
        "year": null,
        "description": "Birdy is a story about two friends who serve in the Vietnam War, showing both their pre-war and post-service interactions. This movie features excellent early performances from both Nicolas Cage and Matthew Modine, as well as an outstanding score by Peter Gabriel. The end result is a well-made look at mental health and postwar trauma bolstered by a moving story of friendship. Oh and birds, birds are definitely a prominent theme."
    },
    {
        "ranking": 35,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Honeymoon in Vegas",
        "year": null,
        "description": "This movie is ridiculous from start to finish in the best ways. Nicolas Cage plays a private investigator who is going to marry his girlfriend (Sarah Jessica Parker) in Las Vegas, but when he is conned in a card game by a professional gambler (the late, great James Caan), he agrees to let the gambler spend the weekend with his girlfriend to erase the debt. This absurd plot setup leads to a romantic screwball comedy filled with hilarious moments and many non-believable yet amusing situations. Despite rarely exploring the genre, Cage has a knack for comedy, and was even (rightfully) nominated for Best Actor in a Comedy at the Golden Globes for Honeymoon in Vegas. Make sure to stick around to the end for Cage to showcase some of his Elvis fandom."
    },
    {
        "ranking": 36,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Seeking Justice",
        "year": null,
        "description": "If you have kept up with this list or are also a Nicolas Cage fan, you may have noticed that Cage has been in a lot of action-thrillers. Seeking Justice is one of his best, with the director successfully building an aura of mystery and suspense throughout. Ignore the worst actor Razzie nomination: Cage is not bad here in a tamer-than-usual performance as a teacher who becomes involved with a mysterious vigilante group. Rounded out with good performances from Guy Pearce and January Jones, great pacing, and a thrilling ending, Seeking Justice is an excellent (and apparently, underrated) Cage movie that just happened to come out in the era when it was en vogue to clown on Cage."
    },
    {
        "ranking": 37,
        "tier": 2,
        "tier_description": "Excellent Cage Movies",
        "title": "Knowing",
        "year": null,
        "description": "Knowing is an ominous and creepy science fiction movie about a list of numbers found in a time capsule which correctly predicted information about various disasters. The first two-thirds of Knowing are stellar, effectively combining a slow-burn unravel of a mystery with intense action sequences. Nicolas Cage similarly excels at alternating between being a moody widowed father and an MIT astrophysics professor turned action hero. Unfortunately, the final third brings this movie down a bit and Knowing would be much higher on this list if not for the weaker resolution. I know some people like the ending, but I do not. Still, Knowing’s premise and Cage’s performance make this a more than worthwhile watch, particularly if you like science fiction."
    },
    {
        "ranking": 38,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "Primal",
        "year": null,
        "description": "If you asked A.I. to write a plot to a Nicolas Cage movie, it would likely generate something like Primal. Nicolas Cage plays a big-game hunter who is transporting his animals (including a rare white jaguar) on a container ship also transporting a political assassin/ex-special forces operative who breaks free and then frees the animals. The premise is wild and Cage absolutely matches that energy throughout. And while some of the special effects are abysmal and the movie devolves at points to a standard bloodbath shoot-em-up, Cage and the setup more than make up for these resulting in an incredibly fun and entertaining hour-and-a-half."
    },
    {
        "ranking": 39,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "The Frozen Ground",
        "year": null,
        "description": "The Frozen Ground is a serial killer investigation movie based on the true story of Robert Hansen a/k/a the Butcher Baker, a serial killer active in Anchorage, Alaska in the 1970s and 1980s. Despite being relatively by-the-numbers for the genre, the solid lead performances by Nicolas Cage and John Cusack combined with well-paced directing, writing, and editing result in this movie being a tense, interesting mystery-thriller. As an added bonus, the Alaskan scenery throughout is beautifully filmed."
    },
    {
        "ranking": 40,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "Peggy Sue Got Married",
        "year": null,
        "description": "This third and final collaboration between Nicolas Cage and his uncle, Francis Ford Coppola, includes by far the most significant screentime for Cage. Peggy Sue Got Married  is a dramedy about a woman disillusioned with her high-school-sweetheart husband’s infidelity and is magically transported back to her senior year of high school. It is funny, it is sweet, and it involves Cage doing a strange nasally voice, wearing false teeth, and dropping numerous hilarious lines throughout. Interesting fact: Cage successfully sued co-star Kathleen Turner for defamation after she wrote numerous negative things about Cage in her 2008 memoir, including that Cage was arrested for drunk-driving twice and for stealing a dog (“He’d come across a chihuahua he liked and stuck it in his jacket.”)"
    },
    {
        "ranking": 41,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "The Family Man",
        "year": null,
        "description": "In the early 2000s, Nicolas Cage randomly entered into a holiday movie era, starring in The Family Man in 2000 and voicing Jacob Marley in an animated Christmas Carol movie in 2001. The Family Man is an It’s A Wonderful Life-esque tale where Cage, a successful Wall Street executive, wakes up Christmas morning in an alternate reality where he sees what life would have been like had he not taken an overseas internship and instead stayed with his college sweetheart. It is a bit predictable and cheesy, but still a fun holiday crowd-pleaser providing an excuse to have everyone gather around a fire and enjoy Nicolas Cage together."
    },
    {
        "ranking": 42,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "The Runner",
        "year": null,
        "description": "Set against the backdrop of the 2010 BP oil spill, Nicolas Cage plays an up-and-coming congressman trying to rebuild his reputation after a sex scandal. While it does not break much new ground on the political drama genre, this is a well-written movie with a quality Cage performance to boot. Plus, Sarah Paulson is fantastic in everything, so her performance here helps further elevate this movie. With a 90-minute run time and excellent pacing, this is an enjoyable and easily digestible character study."
    },
    {
        "ranking": 43,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "Snake Eyes",
        "year": null,
        "description": "Nicolas Cage plays a corrupt Atlantic City detective investigating the murder of the Secretary of Defense at a boxing match in this Brian De Palma thriller. Cage is hilariously over-the-top in the best way, bringing Detective Santoro to life as the most fun and eccentric crooked cop New Jersey has ever seen. As for the movie itself, it is carried a lot by the first 20 to 30 minutes, ultimately fizzling out into a more mundane mystery thriller with less-than-surprising twists. But that first act and Cage throughout are great enough to make this one worth watching, or at least worth starting."
    },
    {
        "ranking": 44,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "Racing with the Moon",
        "year": null,
        "description": "Young Sean Penn and Nicolas Cage play small town friends both drafted into the Marine Corps who have six weeks before shipping out overseas. Racing with the Moon is a typical 1980s drama, interspersing humor with topics like abortion, classism, and war, resulting in  a sentimental if a bit cheesy movie. Despite being heavier at times, it is an interesting watch to see a young Nicolas Cage still finding his footing as an actor, resulting in a believably awkward and goofier character."
    },
    {
        "ranking": 45,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "Army of One",
        "year": null,
        "description": "It is rare for a purposefully comedic Nicolas Cage performance, but Army of One gives us just that. This film is loosely based on the true story of Gary Faulkner, an ex-construction worker who believed that God ordered him to find and capture Osama Bin Laden and was eventually arrested in Pakistan carrying a katana, night vision goggles, and other equipment. Cage is absurd in this movie and takes everything way over the top (including his voice,) which fits the narrative quite well. Unfortunately, as with Dying of the Light, the film was largely recut (this time by the Weinstein Company) and according to Cage, the movie would have been far better had the director had the final cut. Even so, what we are left with is funny, silly, and entertaining, albeit a bit of a mess."
    },
    {
        "ranking": 46,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "The Trust",
        "year": null,
        "description": "My previously expressed millennial-induced adoration for Hayden Christensen is even stronger for Elijah Wood, so I was thrilled to see him collaborate with Nicolas Cage. The result is an uneven yet wildly enjoyable movie that is part buddy-cop comedy and part crime thriller. Here, Cage and Wood play cops working in the Evidence Management unit who discover a mysterious unguarded safe and plan a heist. While both actors are great, Cage really shines here with his quirkiness off the charts, making some more by-the-numbers stretches of the film fun to watch."
    },
    {
        "ranking": 47,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "City of Angels",
        "year": null,
        "description": "Nicolas Cage is an otherworldly being, and in City of Angels, he plays an angel who falls in love with a doctor and must decide whether to become human to be with her or remain an angel. Equal parts sappy and sad, this movie is much better than one may expect, successfully elevating a formulaic romantic drama to raise deeper questions. Cage opposite Meg Ryan in a romantic 1990s movie just shows what a superstar he was at the time, and he certainly helps upgrade this movie. Have the tissues ready."
    },
    {
        "ranking": 48,
        "tier": 3,
        "tier_description": "Great Cage Movies",
        "title": "Butcher's Crossing",
        "year": null,
        "description": "Butcher’s Crossing is a beautifully shot western featuring an excellent performance from Nicolas Cage. It tells the story of a Harvard dropout teaming up with an intense and experienced buffalo hunter (Cage) as part of a ragtag team that finds and successfully hunts a huge buffalo herd, but becomes trapped over winter in the snowy Colorado wilderness. It meanders at times, but Cage brings it back in focus and ties it all together, resulting in an intense movie about obsession and its consequences à la Moby Dick in the mountains."
    },
    {
        "ranking": 49,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "The Wicker Man",
        "year": null,
        "description": "Sometimes you like Nicolas Cage movies because they are great movies, sometimes you like them because he gives an amazing performance that elevates the rest of the film, and sometimes you just like them because they are hilariously ridiculous. To be clear: The Wicker Man is not the 49th best movie Cage has been in based on quality, but it is just too iconic and so-bad-its-good funny to drop any lower. It is hard to pick a favorite Cage scene, between the “how’d it get burned?!” freakout, Cage walking into an inn and just decking a random lady casually with little-to-no explanation, Cage dressed as a bear and getting a running head start to punch a woman as she asks “what is wrong sister,” and of course the infamous “NOT THE BEES” scene. My personal favorite is when Cage, a police officer investigating the disappearance of his daughter, shows up on the island and is greeted by a group of people holding a nefarious looking bag. He asks, “what’s in the bag, a shark or something?” and then tries to look, but the people jerk the bag when he gets close to make him jump back from the bag. He never investigates or questions this further. It is a top-tier hilariously bad movie and if you have somehow not yet experienced it, I highly recommend a viewing."
    },
    {
        "ranking": 50,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Arcadian",
        "year": null,
        "description": "Arcadian is a really well done post-apocalyptic horror movie that keeps the viewer on edge by only revealing scant details about the background and threats of the dystopian world, instead plopping you right in the middle of this terrifying future. The best part of Arcadian are the fascinating monsters, with one of the best and creepiest reveals I've seen in a recent creature feature. The only problem keeping this from a higher spot is an underutilization of Nicolas Cage, focusing instead on his character’s sons and leaving large Cage-free stretches throughout."
    },
    {
        "ranking": 51,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "The Sorcerer's Apprentice",
        "year": null,
        "description": "Producer Jerry Bruckheimer had a string of collaborations with Nicolas Cage, with the Rock, Con Air, Gone in 60 Seconds, both National Treasure films (also directed by Turteltaub), G-Force, and lastly The Sorcerer’s Apprentice. Of the films ranked here (i.e., excluding G-Force), this was their weakest collaboration, but it is still an enjoyable film. The Sorcerer’s Apprentice (which takes its name from segments in Disney’s Fantasia and Fantasia 2000 and features a brief tribute to these segments) is a prime example of the 2000s summer blockbusters: It has easily understandable world-building, nice-looking CGI, comedy mixed in with every action sequence, popular alternative rock songs, and predictable romance. Cage is also a hoot here, playing a 1,000-year-old sorcerer in modern times training a reluctant physics student to harness Merlin’s powers to stop the end of the world."
    },
    {
        "ranking": 52,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Kick-Ass",
        "year": null,
        "description": "I know some are surprised to see Kick-Ass this low on the list but hear me out: Kick-Ass is an absolutely fantastic movie that is a hilarious take on the superhero genre and Nicolas Cage as Big Daddy is a top-tier performance. . . for his around 15 minutes of screen-time. Indeed, while this is a standout Cage performance in a great movie, it is sadly such a small dose of Cage that it was hard to put any higher. If you have not seen Kick-Ass though, I highly recommend it as a movie regardless of the sad lack of significant Cage. And hey, despite my complaints about Cage deserving a better superhero franchise than Ghost Rider, he did at least get a great one off appearance in this superhero franchise."
    },
    {
        "ranking": 53,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Pay the Ghost",
        "year": null,
        "description": "A supernatural horror movie about children being abducted is not that original of an idea, but I still enjoyed Pay the Ghost more than expected. The CGI is laughable at times which takes away from some of the would-be “scarier” moments, but the mystery aspect of the disappearance unravels at a good clip to keep it interesting. As for Nicolas Cage, he does not have to do much here and plays this role in a straightforward manner."
    },
    {
        "ranking": 54,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "A Score to Settle",
        "year": null,
        "description": "A Score to Settle is yet another in a long line of late-2010 generic action thriller/crime thriller movies starring Nicolas Cage. Here, Cage plays a gangster who takes the fall for a murder but seeks revenge when he is released from his life sentence early due to a medical condition. It has good pacing, decent twists, and a few quality Cage freakouts in an otherwise subdued but solid performance."
    },
    {
        "ranking": 55,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Next",
        "year": null,
        "description": "Nicolas Cage as a Las Vegas magician who becomes an NSA-targeted asset to help stop a nuclear explosion because of his ability to see two minutes into the future should be a much better movie than Next. This loose adaptation of a Phillip K. Dick story is good but not great. It falters mostly because of an incredibly weak conclusion where the filmmakers rely on the most obnoxious storytelling mechanisms (no spoilers but if you know you know). That said, Cage is excellent in the first half of this movie when the script allows him be his Vegas magic-powered self and that alone makes it worth watching at least once."
    },
    {
        "ranking": 56,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Sympathy for the Devil",
        "year": null,
        "description": "Sympathy for the Devil is a wild ride with some great elements and an amusingly unhinged Nicolas Cage performance. This movie about a mysterious man forcing an expectant father to drive away from the hospital to destinations unknown takes a bit of time to get interesting, but it eventually reveals itself as less of an action thriller and more of a character study with a slow drip of information about the two principal players. It is a good Cage movie worth watching for his performance alone, but this also feels like a missed opportunity for a much better film."
    },
    {
        "ranking": 57,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Dog Eat Dog",
        "year": null,
        "description": "Nicolas Cage’s second collaboration with Paul Schrader as director after Dying of the Light is an action thriller meets dark comedy about ex-cons trying to kidnap a baby. Cage and Willem Dafoe are both unhinged in this movie, sometimes for better and sometimes for worse. On one hand, this movie is all over the map with incredibly dislikable characters and lots of random violence seemingly played up for laughs and/or shock value. On the other hand, Cage has some truly amusing moments, particularly because he is clearly meant to be playing the straight man here to Dafoe’s craziness, yet (as per usual) makes his character super quirky. It may not be amazing, but it definitely is not boring."
    },
    {
        "ranking": 58,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Running with the Devil",
        "year": null,
        "description": "If you have ever wanted to see a movie tracking the journey of cocaine from fields to processing facility and across the border, you now have the opportunity to do so while getting to watch Nicolas Cage. Even though there are some thrilling moments, for the most part this movie becomes tedious because of slow pacing and disjointed storylines. Still, Cage and Laurence Fishburne do make a good enough duo to overcome some of the shortcomings, resulting in a solid yet cliché drug trade thriller."
    },
    {
        "ranking": 59,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "The Retirement Plan",
        "year": null,
        "description": "Nicolas Cage is retired from his life as a government assassin and is quietly living in the Cayman Islands until his daughter becomes entangled with a crime syndicate. This leads Cage to come out of retirement so he can beat the crap out of Ron Perlman and his goons. It is a predictable yet fun action comedy that has some entertaining Cage moments and a few wild Cage killing sprees, but is still somehow mostly forgettable."
    },
    {
        "ranking": 60,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "The Cotton Club",
        "year": null,
        "description": "Alas, yet another solid movie lower in the rankings for not enough Nicolas Cage. This is the second of three movies (along with Rumble Fish and Peggy Sue Got Married) where Cage teamed up with his Uncle Francis, this time playing Richard Gere’s mobster younger brother in a movie about the titular 1930s Harlem jazz club. As I stated with Rumble Fish, if you like Francis Ford Coppola movies, watch The Cotton Club for that reason and just stay for the Cage. If you are watching movies for Nicolas Cage, this one is mostly skippable."
    },
    {
        "ranking": 61,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Zandalee",
        "year": null,
        "description": "If you’ve made it this far on the list, I cannot lie to you: Zandalee is not a good movie. This straight-to-video “erotic thriller” is just goofy at times, particularly the comedically bad performance by Judge Reinhold (not that he had much to work with here). But to me this movie falls into the mythical “so bad it is good” category and is frequently downright hilarious. This is mostly due to one of the strangest and most over-the-top Nicolas Cage performances which catapults it from the depths of where it would rank were this a simple movie ranking and not a Cage movie ranking. Here, Cage plays Johnny Collins, a free-spirited artist who dabbles as a cocaine mule and begins an affair with his friend’s wife. Despite best efforts to be steamy, the romance is painful, but boy are there some golden Cage moments to go along with his outrageous facial hair."
    },
    {
        "ranking": 62,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Kill Chain",
        "year": null,
        "description": "There was a brief time in the late 2010s when I sadly fell behind in watching each new Nicolas Cage movie as they came out and when I began planning on catching up, I remember thinking Kill Chain seemed like the most generic name and plot for a Cage action thriller. While that prediction is not too far off, Kill Chain is a mostly enjoyable neo-noir movie with some decent action sequences and quick pacing, though it is essentially just numerous tenuously linked subplots about shootouts between cops, gangsters, assassins, etc. Really, the main thing it is lacking is more Cage, as he is only on-screen about a third of the movie."
    },
    {
        "ranking": 63,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Looking Glass",
        "year": null,
        "description": "Looking Glass is a slow-paced thriller about a couple that buys a motel in the desert. And you know what? It is a pretty good movie. No, it is not groundbreaking and Nicolas Cage has only a few standout moments while otherwise not doing too much heavy lifting, but I still found myself engaged in the mystery the whole time. Though not enough to catapult it up the list, this is an underrated outing from the prolific mid-2010 era of Cage."
    },
    {
        "ranking": 64,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Captain Corelli's Mandolin",
        "year": null,
        "description": "This is a big-budget, 2+-hour wartime romance based on a 1990s novel and directed by the man who brought you Shakespeare in Love. Captain Corelli's Mandolin stars Nicolas Cage as a World War II Italian officer who falls in love with Penelope Cruz, a Greek villager. It is cheesy, it is bloated, and it has some questionable accents from most everyone involved, but it nonetheless has its moments, including beautiful cinematography and some sound Cage acting. The man is for sure passionate about mandolins, as disclosed by the title. You may not buy the romance between Cage and Cruz, but you will likely to enjoy other parts of the film."
    },
    {
        "ranking": 65,
        "tier": 4,
        "tier_description": "Good Cage Movies",
        "title": "Between Worlds",
        "year": null,
        "description": "Believe it or not, this movie was probably the hardest to rank on this entire list. On one hand, it is a supernatural thriller that is not scary, not really thrilling, and all over the place with some astoundingly bad dialog. On the other hand, the plot is so unabashedly strange and Nicolas Cage leans in so hard that it is impossible to look away from this traumatizing yet hilarious wild ride. Here is a brief summary of the plot (with first half spoilers): Cage plays a truck driver who walks in on Julie being choked at a truck stop. It turns out Julie had asked the man to choke her because she nearly drowned as a child and can now enter the spirit world. Her daughter, Billie, is in a coma and Julie wants to find Billie’s spirit in the spirit world. At the hospital, when Billie goes into cardiac arrest, Cage chokes Julie and she leads Billie’s spirit back to her body, saving her. Cage and Julie go home together and have lots of sex over the course of a few days leading to Cage being fired as a trucker for not delivering the goods in a timely fashion, after which he mourns this loss because he thinks a man without a truck is not a man. Billie comes home and begins making sexual advances on Cage because it turns out that the spirit of Cage’s dead wife (Mary) actually entered Billie’s body when Cage was choking Julie. Cage then has sex with Billie/Mary, and at one point during he reads to her from a book titled “Memories” by Nicolas Cage (adding a meta element to this craziness.) Julie becomes suspicious and speaks to a nurse at the hospital, who naturally is knowledgeable about the logistics of the spirit world and gives her advice. All this to say: Between Worlds cannot be higher because it is objectively not a great movie, but at the same time I highly recommend it."
    },
    {
        "ranking": 66,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Snowden",
        "year": 2016,
        "description": "One nice thing about Nicolas Cage movies is that he became a leading man so early, there are really few movies where he plays a small supporting part. For some reason, in 2016, he made a short appearance in Oliver Stone’s Edward Snowden movie. As with Rumble Fish, this is a good movie, but does not warrant being ranked higher in a list of Cage movies."
    },
    {
        "ranking": 67,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Rumble Fish",
        "year": null,
        "description": "This is the exact type of situation discussed in the introduction above: Rumble Fish is a good 1980s Coppola movie starring Matt Dillon trying to live up to his reputation as the younger brother of a legendary gang figure (Mickey Rourke), but Nicolas Cage is only in a small supporting role. Thus, while I generally recommend watching Rumble Fish if you like Francis Ford Coppola movies, it does not warrant being ranked higher in a list of Nicolas Cage movies."
    },
    {
        "ranking": 68,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Windtalkers",
        "year": null,
        "description": "The story of code talkers from the Navajo Nation during World War II is incredibly fascinating. That makes it a shame that it feels like this movie made the code talkers story a subplot to a run-of-the-mill war movie instead of making it the focus. While Nicolas Cage’s character’s growing friendship with a Navajo code talker is powerful at times, this movie simply does too little with an interesting story to be any higher."
    },
    {
        "ranking": 69,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "The Humanity Bureau",
        "year": null,
        "description": "The Humanity Bureau is a dystopian thriller film with Nicolas Cage starring in a relatively toned down role as a rogue government agent. There are some interesting elements in this movie and the world building is decent. But there is also a lot of cliché storytelling, complete with predictable twists and turns and a main villain with an eye patch. At the end of the day, there are far better dystopian movies and much better Cage performances, but if you (like me) enjoy this genre and you love Nicolas Cage, then it is worth a watch, so long as your expectations are not too high."
    },
    {
        "ranking": 70,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Dying of the Light",
        "year": null,
        "description": "Paul Schrader (writer of Taxi Driver and co-writer of Raging Bull) wrote and directed Dying of the Light, but was denied final-cut privileges by the studio, which heavily re-edited the movie. This led to Schrader, Nicolas Cage, and other members of the cast coming out against the movie as released. It is a shame, because although the released cut is clunky and lacking in vision, there is enough left of this story of Cage as an ex-CIA agent suffering from dementia seeking personal revenge to show a potentially great movie. As it stands, despite some promising moments, this film cannot be any higher in the rankings."
    },
    {
        "ranking": 71,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Fire Birds",
        "year": null,
        "description": "Top Gun was one of the most popular movies of the 1980s, so it is not surprising that there were imitations. Fire Birds lifts many of the same plot elements of Top Gun but with much worse dialog, cinematography, acting. . . pretty much everything. Nicolas Cage does his best here with an uneven script and a shockingly poor supporting cast, but most of the movie gives him nothing to do but look moody in a helicopter in between video game-esque helicopter dogfights."
    },
    {
        "ranking": 72,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Bangkok Dangerous",
        "year": null,
        "description": "In Bangkok Dangerous, Nicolas Cage plays an experienced hitman who usually never socializes more than required on missions and hires small-time criminals for assistance before disposing of them. Of course, he struggles with the mission depicted in the film because he does things like date a local deaf-mute pharmacist and mentor his pickpocket assistant. This remake of the Pang Brothers' Thai film of the same name is a straightforward action movie that requires little attention to modestly enjoy, though it is a bit difficult to believe Cage wandering around with a quasi-mullet as a conspicuous hitman in Bangkok."
    },
    {
        "ranking": 73,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Vengeance: A Love Story",
        "year": null,
        "description": "Nicolas Cage plays a police officer who takes matters into his own hands after a group of rapists are acquitted in court. While this is definitely a trope-filled, no-frills vigilante justice movie, both the film itself and Cage were actually more engaging than I expected. Nonetheless, it still plods along for much of the story and really has nothing new to add to the genre, with the result feeling like a high-end television movie with Cage."
    },
    {
        "ranking": 74,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Deadfall",
        "year": null,
        "description": "Let me get this out of the way: This movie is truly terrible from a writing, directing, and (for the most part) acting standpoint. The star, Michael Biehn, gives one of the most painfully uninspired performances I've ever seen. But when Nicolas Cage is on screen, he is electric, insane, and so much fun to watch. There is not a moment he does not take this iteration of the Eddie King character to an eleven. It may be worth watching one of the many highlight reels of Cage in Deadfall on YouTube instead of suffering through all 98 minutes, though none of these compilations do justice to just how out-of-place chaotic Cage is in this otherwise mundane crime drama."
    },
    {
        "ranking": 75,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "It Could Happen to You",
        "year": null,
        "description": "Nicolas Cage reunites with the Honeymoon in Vegas director for It Could Happen to You, which is sentimental, sappy, and pretty average fare for a 1990s rom-com-dram. Inspired by a true story, Cage plays a police officer who cannot tip his waitress and offers to split winnings from a lottery ticket, which ends up being $4 million. Complete with comically evil spouses, this predictable love story features one of the more subdued Cage performances and is a generally pleasant, if forgettable, watch."
    },
    {
        "ranking": 76,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "8mm",
        "year": null,
        "description": "In 8mm, Nicolas Cage plays a private investigator who ends up deep in the world of snuff films. The uncomfortable subject matter makes this a hard watch, and the screenplay does not help. At its core, it is a run-of-the-mill detective movie with added shock value and a solid Cage performance."
    },
    {
        "ranking": 77,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "World Trade Center",
        "year": 2006,
        "description": "Nicolas Cage plays a police officer who was one of only 20 people pulled out of the rubble alive at Ground Zero. This is not the strongest September 11 movie and it frequently feels like the movie misses the emotional response it is trying to elicit. From 2006 alone, I find that United 93 was a much stronger and more impactful movie about September 11 than World Trade Center. At the end of the day, as much as I wanted to like this movie based on the subject matter, the heroes depicted therein, and Nicolas Cage, this movie feels a bit like a rushed attempt to get a movie out five years after September 11."
    },
    {
        "ranking": 78,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Outcast",
        "year": null,
        "description": ""
    },
    {
        "ranking": 79,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Rage (Tokarev)",
        "year": null,
        "description": "Oh look – another Taken-esque action thriller. In Rage (titled Tokarev internationally,) Nicolas Cage is a former gangster turned legitimate businessman who is trying to track down his daughter’s killer, and naturally, shooting every single possible person with information before asking them questions is the best plan. There are some redeeming moments here, with a few high-quality Cage freakouts. Frankly, Cage completely carries this movie from the bottom of the list, with weak performances from supporting players and painful directorial choices (e.g., make the Russian mafia boss have a full-back tattoo of Saint Basil’s Cathedral and make sure to do slow zooms of it in case it was not obvious enough). Even the final plot twist which could have elevated the story to have some deeper meaning and message than your average revenge-bloodbath movie mostly falls flat on its face. At least it is better than Stolen."
    },
    {
        "ranking": 80,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Trespass",
        "year": null,
        "description": "Despite its star power of Nicolas Cage and Nicole Kidman, Trespass really misses the mark as far as home invasion movies go. There are just too many close calls, stand-offs, twists, and betrayals for the viewer to care about any of the characters or the boiler plate storyline. Cage has a few moments where he shines through and overcomes the script, but these are not enough to pull it further up the list. But if you need some good random Cage freak-outs, this one is packed with them."
    },
    {
        "ranking": 81,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Ghost Rider",
        "year": null,
        "description": "Nicolas Cage loves comic books and superheroes. His choice of stage name was partially inspired by superhero Luke Cage. He was set to play Superman in Tim Burton’s cancelled Superman film in the 1990s. His son is named Kal-El. Nicolas Cage deserves to be in a better comic book franchise than Ghost Rider. The first Ghost Rider film does have entertaining and Cage-y moments, but all in all, this movie is mostly show and little substance. If you are a Cage fan or a Marvel fan, there are worse things you could do with a rainy afternoon. But fingers crossed Cage’s upcoming outing in Spider-Man Noir is more enjoyable."
    },
    {
        "ranking": 82,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Guarding Tess",
        "year": null,
        "description": "Nicolas Cage plays the bodyguard for a former First Lady and, surprise, they are different and do not get along but learn to be friends through spending time together. Think Driving Miss Daisy without trying to address issues of racism (my DVD copy even features the review: “ Driving Miss Daisy with attitude.”) Cage and Shirley MacLaine both give solid performances in a movie that could have been a 45-minute short film and told essentially the same story."
    },
    {
        "ranking": 83,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Grand Isle",
        "year": null,
        "description": "Grand Isle is frustrating, as the first half nails setting up the atmosphere and characters for a fascinating Southern Gothic-esque action drama wherein a man recounts the strange events leading up to a murder. Unfortunately, it all quickly unravels with each plot twist and by the end it is hard to overlook the directing and writing. Nicolas Cage does have a few shining moments here, but he also seems to fade in his enthusiasm for the role through large stretches."
    },
    {
        "ranking": 84,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "The Boy in Blue",
        "year": null,
        "description": "In the post-Chariots of Fire sports movie craze, it was only natural that a young Nicolas Cage star in a sappy drama about a bootlegger turned Canadian competitive rowing champion. Pick almost any other sports biopic in the last 50 years and you have seen a version of this movie, down to the Rocky training montage. Cage is not bad here, but it is clear he is still finding his footing as an actor."
    },
    {
        "ranking": 85,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Trapped in Paradise",
        "year": 1995,
        "description": "If you ever feel like next year might really be your year: In 1995, Nicolas Cage starred in Leaving Las Vegas and won the Academy Award for Best Actor, but the year before, he was in a shockingly dull Christmas-themed comedy/crime/action film. Cage plays a restaurant manager who helps his recently paroled brothers rob a bank, followed by your classic snowy small-town antics and the convenient (yet unbelievable) happenstance required to move the story along. At times, stretches of dialog will be painful enough that you will forget that this was written as a comedy. It is not in the bottom tier simply because Cage tries his best to make this one at least interesting, despite everyone else providing little of value."
    },
    {
        "ranking": 86,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "Inconceivable",
        "year": null,
        "description": "A stranger with a four-year-old daughter moves into a doctor couples' guest house and becomes a part-time nanny for their four-year-old daughter, but does she have a deeper connection than expected and could she be keeping secrets? Nicolas Cage largely fades into the background of this highly implausible drama/thriller filled with plot twists that you can see from a mile away. But it does reunite Cage and Gina Gershon from Face/Off, so that is better than nothing!"
    },
    {
        "ranking": 87,
        "tier": 5,
        "tier_description": "Decent Cage Movies",
        "title": "The Old Way",
        "year": null,
        "description": "This ranking might be more disappointment than anything else. When I heard Nicolas Cage was going to be in a Western, you could not sign me up quickly enough! Unfortunately, this movie is derivative and predictable, with Cage being cabined to typical tropes and not being allowed to flesh out the character as well as he could. At the end of the day, if you need a Cage fix, this is an inoffensive Western about a retired outlaw hunting the men who killed his wife."
    },
    {
        "ranking": 88,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "Stolen",
        "year": null,
        "description": "“12 Hours. $10 Million. 1 Kidnapped Daughter.” Reuniting with the director of Con Air, Nicolas Cage stars in a movie that was definitely not “Stolen” from any other popular movie from around that time. This Taken-ripoff features Cage as a thief recently released from prison who must rescue his kidnapped daughter from his former heist partner. It is a run-of-the-mill action movie with Cage doing little to make it more interesting."
    },
    {
        "ranking": 89,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "Arsenal",
        "year": 1993,
        "description": "Speaking of Nicolas Cage movies not needing a “sequel”: In 1993, Cage was in a film directed by his brother called Deadfall, which is heavily featured in many of the Nicolas Cage freaking out YouTube montages that were all the rage 15 years ago. Deadfall made less than $20,000 at the box office and currently has a 0% on Rotten Tomatoes. For some inexplicable reason, almost 25 years later Cage reprised his role from Deadfall in an unrelated movie about two brothers being caught up in organized crime, with Cage’s character being the primary antagonist mobster. While Cage made Deadfall (somewhat) worth watching, this rehash is not only unnecessary but consistently feels like it threw Cage into a role referencing a heavily memed performance to drum up some relevance for an uninspired and cliché B-movie. The few truly funny moments from Cage keep it from an even lower spot."
    },
    {
        "ranking": 90,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "Ghost Rider: Spirit of Vengeance",
        "year": null,
        "description": ""
    },
    {
        "ranking": 91,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "Sonny",
        "year": null,
        "description": "As noted above, this was almost excluded from this list, but it felt wrong to cut it since it is Nicolas Cage’s sole directorial outing. This movie shows why Cage belongs in front of the camera and not behind it, with clunky pacing and a lot of baffling storytelling decisions. But his brief appearance as Acid Yellow—a pimp/drug dealer who paints his poodles and is vocal about his love for cocaine—is one of Cage’s more insane characters, making it worth looking up Cage’s few scenes. Alas, the remainder of this tale of James Franco as a New Orleans gigolo is weak enough to pull it down near the bottom of this list."
    },
    {
        "ranking": 92,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "USS Indianapolis: Men of Courage",
        "year": null,
        "description": "First, a positive: The CGI is hilarious, particularly some of the sharks. Honestly, some of these lowest-ranked Nicolas Cage movies are not unwatchably terrible as much as they are painfully boring and forgettable, two words which should NOT be used with Nicolas Cage. This World War II movie about the loss of the USS Indianapolis ship features one of the most subdued and uninterested Cage performances out there, though there was admittedly little for him to do with this script."
    },
    {
        "ranking": 93,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "211",
        "year": null,
        "description": "211 is the California Penal Code for robbery, which makes it a logical title for a movie about a bank heist in Massachusetts. This is a stereotypical action movie with Nicolas Cage playing a cop partnered with his son-in-law during a bank robbery shootout. There are no frills and nothing to be interested in, particularly as Cage himself also seems to just be going through the motions on this one."
    },
    {
        "ranking": 94,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "Jiu Jitsu",
        "year": null,
        "description": "It seems strange that a Nicolas Cage movie about an ancient order of Jiu Jitsu fighters facing aliens in a battle to save Earth every six years would be this low on the list because that sounds brilliant on paper. Unfortunately, Cage is not nearly featured enough, and his brief appearances cannot save the atrocious CGI, poorly filmed stunt fighting, and some of the most painful dialog ever put to screen. And while I know little about martial arts, the online consensus is that this movie titled Jiu Jitsu in fact includes no jiu jitsu in it. During some early Cage scenes, it feels like this could be destined for the mythical “so bad it is good” category, but believe me, it is just bad."
    },
    {
        "ranking": 95,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "Tempo di Uccidere (Time to Kill)",
        "year": null,
        "description": "This is an Italian drama that looks like it was shot with a single medium-quality camera. Nicolas Cage plays an Italian soldier during Italy's invasion of Ethiopia who is suffering from a toothache and journeys through the jungle to a camp hospital while committing misdeeds on the native people. At this point in his career, Cage had already been in larger movies like Moonstruck, Raising Arizona, and Peggy Sue Got Married, so his appearance in this film is incredibly confusing. More confusing is his largely lackluster performance, weakened further by mediocre surrounding players. Although not as bad as the previous films, this is Cage’s most forgettable film, and he is usually a hard man to forget."
    },
    {
        "ranking": 96,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "Amos & Andrew",
        "year": null,
        "description": "Samuel L. Jackson, a Pulitzer Prize-winning playwright, buys a vacation home in a Massachusetts resort community. After a shootout due to the police mistaking him for a burglar, the police try to avoid bad publicity by sending an incarcerated thief played by Nicolas Cage to break into Jackson’s home, hold Jackson hostage, and then have Cage give himself up. This already preposterous premise devolves into a buddy action-comedy trying to tackle issues of racism and police brutality but failing in all aspects. Not even occasional strange moments from Cage redeem this painfully unfunny and dull movie."
    },
    {
        "ranking": 97,
        "tier": 6,
        "tier_description": "For Cage Completionists Only",
        "title": "Left Behind",
        "year": null,
        "description": "In the late 2000s and throughout much of the 2010s, Nicolas Cage made some odd role selections. The best (worst?) example of this is Left Behind, a Christian apocalyptic thriller based on a book that had previously been adapted in the 2000s starring Kirk Cameron. This is unquestionably the worst Cage movie to me, not only because the film itself is poorly written and features atrocious CGI and acting, but because Cage is very clearly going through the motions. He does not want to be there and the viewer sure does not want to be watching it. This one is truly for Cage completionists only, and trust me, you will be praying for this one to end. It is at least noteworthy for being one of the 46 movies with over 20 ratings and a Rotten Tomatoes score of 0%."
    }
]